package com.d4c.www.util;

import java.util.Random;
import java.util.UUID;

/**
 * @author JoeZhou
 */
public class BuildUtil {

    /**
     * 生成32位随机字符串，包含大小写英文和数字
     *
     * @return 返回随机生成的UUID值
     */
    public static String buildUuid() {
        return UUID.randomUUID().toString().replace("-", "");
    }

    /**
     * 随机生成昵称
     *
     * @return 返回随机生成的昵称
     */
    public static String buildNickName() {
        String[] familyNames = {
                "赵", "钱", "孙", "李", "周", "吴", "郑", "王", "冯", "陈", "褚", "卫", "蒋", "沈", "韩", "杨",
                "朱", "秦", "尤", "许", "何", "吕", "施", "张", "孔", "曹", "严", "华", "金", "魏", "陶", "姜",
                "戚", "谢", "邹", "喻", "水", "云", "苏", "潘", "葛", "奚", "范", "彭", "郎", "鲁", "韦", "昌",
                "马", "苗", "凤", "花", "方", "俞", "任", "袁", "柳", "鲍", "史", "唐", "费", "岑", "薛", "雷",
                "贺", "倪", "汤", "滕", "殷", "罗", "毕", "郝", "邬", "安", "常", "乐", "于", "时", "傅", "卞",
                "齐", "康", "伍", "余", "元", "卜", "顾", "孟", "平", "黄", "和", "穆", "萧", "尹", "姚", "邵",
                "湛", "汪", "祁", "毛", "禹", "狄", "米", "贝", "明", "臧", "计", "成", "戴", "宋", "茅", "庞",
                "熊", "纪", "舒", "屈", "项", "祝", "董", "粱", "杜", "阮", "席", "季", "麻", "强", "贾", "路",
                "娄", "危", "江", "童", "颜", "郭", "梅", "盛", "林", "刁", "钟", "徐", "邱", "骆", "高", "夏",
                "蔡", "田", "胡", "凌", "霍", "万", "柯", "卢", "莫", "房", "缪", "干", "解", "应", "宗", "丁",
                "宣", "邓", "郁", "单", "杭", "洪", "包", "诸", "左", "石", "崔", "吉", "龚", "程", "邢", "滑",
                "裴", "陆", "荣", "翁", "荀", "羊", "甄", "家", "封", "芮", "储", "靳", "邴", "松", "井", "富",
                "乌", "焦", "巴", "弓", "牧", "隗", "山", "谷", "车", "侯", "伊", "宁", "仇", "祖", "武", "符",
                "刘", "景", "詹", "束", "龙", "叶", "幸", "司", "韶", "黎", "乔", "苍", "双", "闻", "莘", "劳",
                "逄", "姬", "冉", "宰", "桂", "牛", "寿", "通", "边", "燕", "冀", "尚", "农", "温", "庄", "晏",
                "瞿", "茹", "习", "鱼", "容", "向", "古", "戈", "终", "居", "衡", "步", "都", "耿", "满", "弘",
                "国", "文", "东", "殴", "沃", "曾", "关", "红", "游", "盖", "益", "桓", "公", "晋", "楚", "闫"};
        String[] names = {
                "秀娟", "英华", "慧巧", "美娜", "静淑", "惠珠", "翠雅", "芝玉", "萍红", "娥玲", "芬芳", "燕彩",
                "春菊", "兰凤", "洁梅", "琳素", "云莲", "真环", "雪荣", "爱妹", "霞香", "月莺", "媛艳", "瑞凡",
                "佳嘉", "琼勤", "珍贞", "莉桂", "娣叶", "璧璐", "娅琦", "晶妍", "茜秋", "珊莎", "锦黛", "青倩",
                "婷姣", "婉娴", "瑾颖", "露瑶", "怡婵", "雁蓓", "纨仪", "荷丹", "蓉眉", "君琴", "蕊薇", "菁梦",
                "岚苑", "婕馨", "瑗琰", "韵融", "园艺", "咏卿", "聪澜", "纯毓", "悦昭", "冰爽", "琬茗", "羽希",
                "宁欣", "飘育", "滢馥", "筠柔", "竹霭", "凝晓", "欢霄", "枫芸", "菲寒", "伊亚", "宜可", "姬舒",
                "影荔", "枝思", "思丽", "伟刚", "勇毅", "俊峰", "强军", "平保", "东文", "辉力", "明永", "健世",
                "广志", "义兴", "良海", "山仁", "波宁", "贵福", "生龙", "元全", "国胜", "学祥", "才发", "武新",
                "利清", "飞彬", "富顺", "信子", "杰涛", "昌成", "康星", "光天", "达安", "岩中", "茂进", "林有",
                "坚和", "彪博", "诚先", "敬震", "振壮", "会思", "群豪", "心邦", "承乐", "绍功", "松善", "厚庆",
                "磊民", "友裕", "河哲", "江超", "浩亮", "政谦", "亨奇", "固之", "轮翰", "朗伯", "宏言", "若鸣",
                "朋斌", "梁栋", "维启", "克伦", "翔旭", "鹏泽", "晨辰", "士以", "建家", "致树", "炎德", "行时",
                "泰盛", "雄琛", "钧冠", "策腾", "楠榕", "风航", "弘杨", "琳琳", "明涛", "天天", "家修", "永利"};
        return familyNames[new Random().nextInt(familyNames.length - 1)]
                + names[new Random().nextInt(names.length - 1)];
    }

    /**
     * 随机生成指定位数的验证码
     *
     * @param len 指定位数
     * @return 返回随机生成的指定位数验证码
     */
    public static String buildVerificationCode(int len) {
        StringBuilder result = new StringBuilder();
        String chars = "0123456789abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ";
        for (int i = 0; i < len; i++) {
            result.append(chars.charAt(new Random().nextInt(chars.length() - 1)));
        }
        return result.toString();
    }

}

